{"Includes":[],"Defines":["const ()"],"TypeDefs":[],"Globals":["var ()"],"Structs":["type moov_io_ach_Reader struct {\n\t// file is ach.file model being built as r is parsed.\n\tFile moov_io_ach_File\n\n\t// IATCurrentBatch is the current IATBatch entries being parsed\n\n\t// r handles the IO.Reader sent to be parser.\n\n\t// line is the current line being parsed from the input r\n\n\t// currentBatch is the current Batch entries being parsed\n\n\t// line number of the file being parsed\n\n\t// maxLines is the maximum number of lines to be consumed\n\n\t// recordName holds the current record name being parsed.\n\n\t// errors holds each error encountered when attempting to parse the file\n\n\t// skipBatchAccumulation is a flag to skip .AddBatch\n\n}","type moov_io_ach_ValidateOpts struct {\n\t// SkipAll will disable all validation checks of a File. It has no effect when set on records.\n\n\t// RequireABAOrigin can be set to enable routing number validation\n\t// over the ImmediateOrigin file header field.\n\n\t// BypassOriginValidation can be set to skip validation for the\n\t// ImmediateOrigin file header field.\n\t//\n\t// This also allows for custom TraceNumbers which aren't prefixed with\n\t// a routing number as required by the NACHA specification.\n\n\t// BypassDestinationValidation can be set to skip validation for the\n\t// ImmediateDestination file header field.\n\t//\n\t// This also allows for custom TraceNumbers which aren't prefixed with\n\t// a routing number as required by the NACHA specification.\n\n\t// CheckTransactionCode allows for custom validation of TransactionCode values\n\t//\n\t// Note: Functions cannot be serialized into/from JSON, so this check cannot be used from config files.\n\n\t// CustomTraceNumbers disables Nacha specified checks of TraceNumbers:\n\t// - Ascending order of trace numbers within batches\n\t// - Trace numbers beginning with their ODFI's routing number\n\t// - AddendaRecordIndicator is set correctly\n\n\t// AllowZeroBatches allows the file to have zero batches\n\n\t// AllowMissingFileHeader allows a file to be read without a FileHeader record.\n\n\t// AllowMissingFileControl allows a file to be read without a FileControl record.\n\n\t// BypassCompanyIdentificationMatch allows batches in which the Company Identification field\n\t// in the batch header and control do not match.\n\n\t// CustomReturnCodes can be set to skip validation for the Return Code field in an Addenda99\n\t// This allows for non-standard/deprecated return codes (e.g. R97)\n\n\t// UnequalServiceClassCode skips equality checks for the ServiceClassCode in each pair of BatchHeader\n\t// and BatchControl records.\n\n\t// AllowUnorderedBatchNumebrs allows a file to be read with unordered batch numbers.\n\n\t// AllowInvalidCheckDigit allows the CheckDigit field in EntryDetail to differ from\n\t// the expected calculation\n\n\t// UnequalAddendaCounts skips checking that Addenda Count fields match their expected and computed values.\n\n\t// PreserveSpaces keeps the spacing before and after values that normally have spaces trimmed during parsing.\n\n\t// AllowInvalidAmounts will skip verifying the Amount is valid for the TransactionCode and entry type.\n\n}","type moov_io_ach_File struct {\n\tHeader moov_io_ach_FileHeader `json:\"fileHeader\"`\n\n\t// NotificationOfChange (Notification of change) is a slice of references to BatchCOR in file.Batches\n\n\t// ReturnEntries is a slice of references to file.Batches that contain return entries\n\n\tvalidateOpts *moov_io_ach_ValidateOpts\n}","type moov_io_ach_FileHeader struct {\n\t// ID is a client defined string used as a reference to this record.\n\n\t// PriorityCode consists of the numerals 01\n\n\t// ImmediateDestination contains the Routing Number of the ACH Operator or receiving\n\t// point to which the file is being sent. The ach file format specifies a 10 character\n\t// field begins with a blank space in the first position, followed by the four digit\n\t// Federal Reserve Routing Symbol, the four digit ABA Institution Identifier, and the Check\n\t// Digit (bTTTTAAAAC). ImmediateDestinationField will append the blank space to the\n\t// routing number.\n\n\t// ImmediateOrigin contains the Routing Number of the ACH Operator or sending\n\t// point that is sending the file. The ach file format specifies a 10 character\n\t// field begins with a blank space in the first position, followed by the four digit\n\t// Federal Reserve Routing Symbol, the four digit ABA Institution Identifier, and the Check\n\t// Digit (bTTTTAAAAC). ImmediateOriginField will append the blank space to the\n\t// routing number.\n\n\t// FileCreationDate is the date on which the file is prepared by an ODFI (ACH input files)\n\t// or the date (exchange date) on which a file is transmitted from ACH Operator\n\t// to ACH Operator, or from ACH Operator to RDFIs (ACH output files).\n\t//\n\t// The format is: YYMMDD. Y=Year, M=Month, D=Day\n\n\t// FileCreationTime is the system time when the ACH file was created.\n\t//\n\t// The format is: HHmm. H=Hour, m=Minute\n\n\t// This field should start at zero and increment by 1 (up to 9) and then go to\n\t// letters starting at A through Z for each subsequent file that is created for\n\t// a single system date. (34-34) 1 numeric 0-9 or uppercase alpha A-Z.\n\t// I have yet to see this ID not A\n\n\t// RecordSize indicates the number of characters contained in each\n\t// record. At this time, the value \"094\" must be used.\n\n\t// BlockingFactor defines the number of physical records within a block\n\t// (a block is 940 characters). For all files moving between a DFI and an ACH\n\t// Operator (either way), the value \"10\" must be used. If the number of records\n\t// within the file is not a multiple of ten, the remainder of the block must\n\t// be nine-filled.\n\n\t// FormatCode a code to allow for future format variations. As\n\t// currently defined, this field will contain a value of \"1\".\n\n\t// ImmediateDestinationName us the name of the ACH or receiving point for which that\n\t// file is destined. Name corresponding to the ImmediateDestination\n\n\t// ImmediateOriginName is the name of the ACH operator or sending point that is\n\t// sending the file. Name corresponding to the ImmediateOrigin\n\n\t// ReferenceCode is reserved for information pertinent to the Originator.\n\n\t// validator is composed for data validation\n\n\t// converters is composed for ACH to GoLang Converters\n\n\tvalidateOpts *moov_io_ach_ValidateOpts\n}"],"Function Declarations":["","",""],"Function Implementations":["func (fh *moov_io_ach_FileHeader) SetValidation(opts *moov_io_ach_ValidateOpts) {\n\tif fh == nil {\n\t\treturn\n\t}\n\tfh.validateOpts = opts\n}","func (f *moov_io_ach_File) SetValidation(opts *moov_io_ach_ValidateOpts) {\n\tif f == nil {\n\t\treturn\n\t}\n\n\tf.validateOpts = opts\n\tf.Header.SetValidation(opts)\n}","func (r *moov_io_ach_Reader) SetValidation(opts *moov_io_ach_ValidateOpts) {\n\tif r == nil || opts == nil {\n\t\treturn\n\t}\n\tr.File.SetValidation(opts)\n}"],"Enums":[]}
